Looking at this again, I re-tested with the latest version (v0.2.0) of the AVM module.

It still threw the same `500 Internal Server Error` error.

All the other resources seem to create without issue. The error consistently occurs when it attempts to create the `module.github_runners.module.container_app_job[0].azapi_resource.job` resource.

So, thinking about it further, I though I'd try to manually create the Container App Job in the already created Container App Environment, using the exact values from the `terraform plan`.

**Terraform Plan:**
```terraform
Terraform will perform the following actions:

  # module.github_runners.module.container_app_job[0].azapi_resource.job will be created
  + resource "azapi_resource" "job" {
      + body                      = {
          + properties = {
              + configuration = {
                  + eventTriggerConfig = {
                      + parallelism            = 1
                      + replicaCompletionCount = 1
                      + scale                  = {
                          + maxExecutions   = 100
                          + minExecutions   = 0
                          + pollingInterval = 30
                          + rules           = [
                              + {
                                  + auth     = (sensitive value)
                                  + metadata = {
                                      + owner                     = "bcgov-c"
                                      + repos                     = "ecf-azure-startup-sample-app-serverless"
                                      + runnerScope               = "repo"
                                      + targetWorkflowQueueLength = "1"
                                    }
                                  + name     = "github-runner"
                                  + type     = "github-runner"
                                },
                            ]
                        }
                    }
                  + registries         = [
                      + {
                          + identity = "/subscriptions/xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx/resourceGroups/rg-ghr/providers/Microsoft.ManagedIdentity/userAssignedIdentities/uami-ghr"
                          + server   = "acrghr.azurecr.io"
                        },
                    ]
                  + replicaRetryLimit  = 3
                  + replicaTimeout     = 1800
                  + secrets            = (sensitive value)
                  + triggerType        = "Event"
                }
              + environmentId = "/subscriptions/xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx/resourceGroups/rg-ghr/providers/Microsoft.App/managedEnvironments/cae-ghr"
              + template      = {
                  + containers = [
                      + {
                          + env       = (sensitive value)
                          + image     = "acrghr.azurecr.io/github-runner:bc4087f"
                          + name      = "caj-ghr"
                          + resources = {
                              + cpu    = 1
                              + memory = "2Gi"
                            }
                        },
                    ]
                }
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + location                  = "Canada Central"
      + name                      = "caj-ghr"
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx/resourceGroups/rg-ghr"
      + schema_validation_enabled = true
      + tags                      = {
          + "account_coding" = "000000000000000000000000"
          + "billing_group"  = "e833c2"
          + "ministry_name"  = "CITZ"
        }
      + type                      = "Microsoft.App/jobs@2023-05-01"

      + identity {
          + identity_ids = [
              + "/subscriptions/xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx/resourceGroups/rg-ghr/providers/Microsoft.ManagedIdentity/userAssignedIdentities/uami-ghr",
            ]
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }
    }
```

Interestingly, in the Azure portal, when entering the values manually, the value that Terraform is trying to use for the **container job name** (ie. `caj-ghr`), produces an error!

![Image](https://github.com/user-attachments/assets/790d3daf-aa5a-43fe-9795-742b5bc11346)

The value doesn't seem to conflict, since "Value must consist of lower case alphanumeric characters or '-', start with an alphabetic character, and end with an alphanumeric character and cannot have '--'. The length must not be more than 32 characters."

Manually changing that to `cajghr` passes validation though!

Further, the Container details shows the error "Cannot access ACR 'acrghr.azurecr.io' because admin credentials on the ACR are disabled."

![Image](https://github.com/user-attachments/assets/d19571b2-84e5-4958-9b03-d2e89c614cfe)

When I manually change the Admin Credentials option on the Azure Container Registry via the portal, and re-run `terraform apply` it still throws the 500 internal server error.


A few thoughts come to mind...
- Q: Is the API version used for Microsoft.App/jobs correct? Looking at the latest [Microsoft.App jobs API documentation](https://learn.microsoft.com/en-us/azure/templates/microsoft.app/jobs?pivots=deployment-language-arm-template), I see 7 API versions newer!
- Q: Is the Container Registry required to have `Admin User` enabled?